https://ivan-shamaev.ru/how-to-write-data-to-clickhouse-using-python/

#### Запуск сервера ClickHouse
docker run -d -p 8123:8123 --name clickhouse-server yandex/clickhouse-server

проверяем в браузере: http://127.0.0.1:8123/

подключаемся через DBeaver

#### Создаем новую базу данных (БД)
CREATE DATABASE new_db ENGINE = Memory COMMENT 'The temporary database to test Clickhouse and Apache Superset';
#### Проверяем БД
SELECT name, comment FROM system.databases WHERE name = 'new_db';

#### Вручную добавляем CSV через DBeaver
Правой кнопкой мыши на "Таблицы" -> "Импорт данных"

# ElephantSQL

In [ ]:
! pip install psycopg2-binary

In [1]:
import sqlite3
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

postgres://dweuskou:krwqVcNCzM4pRcq4GSPUYvp0zTLihk7q@balarama.db.elephantsql.com/dweuskou

In [16]:
# создаем подключение к DB на ElephantSQL
con = create_engine('postgresql+psycopg2://dweuskou:krwqVcNCzM4pRcq4GSPUYvp0zTLihk7q@balarama.db.elephantsql.com/dweuskou')

In [36]:
df_new = pd.read_csv('D:/ds/sql education/ds_salaries.csv')

In [83]:
import csv
from io import StringIO

from sqlalchemy import create_engine

def psql_insert_copy(table, conn, keys, data_iter):
    # gets a DBAPI connection that can provide a cursor
    dbapi_conn = conn.connection
    with dbapi_conn.cursor() as cur:
        s_buf = StringIO()
        writer = csv.writer(s_buf)
        writer.writerows(data_iter)
        s_buf.seek(0)

        columns = ', '.join('"{}"'.format(k) for k in keys)
        if table.schema:
            table_name = '{}.{}'.format(table.schema, table.name)
        else:
            table_name = table.name

        sql = 'COPY {} ({}) FROM STDIN WITH CSV'.format(
            table_name, columns)
        cur.copy_expert(sql=sql, file=s_buf)

In [37]:
df_new.to_sql('data_science_salaries',con,index=False,if_exists='replace',method=psql_insert_copy)

#### ДОБАВИМ ЕЩЕ ДВЕ ТАБЛИЦЫ В БАЗУ ДАННЫХ

In [81]:
df_german1 = pd.read_csv('D:/ds/sql_education/german_credit_augmented.csv')

In [82]:
df_german2 = pd.read_csv('D:/ds/sql_education/german_credit_augmented_transactions.csv')

In [84]:
df_german1.to_sql('german_credit_augmented',con,index=False,
                  if_exists='replace',method=psql_insert_copy)

In [85]:
df_german2.to_sql('german_credit_augmented_transactions',con,index=False,
                  if_exists='replace',method=psql_insert_copy)

#### SELECT

In [17]:
def select(sql):
  return pd.read_sql(sql,con)

In [18]:
# создаем запрос
sql = '''select * from german_credit_augmented t'''

In [19]:
# загружаем таблицу из DB
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id
0,33,male,2,own,None,None,3074,9,radio/TV,0,2008-06-29 18:52:00,210
1,43,male,1,own,little,little,1344,12,car,0,2007-05-20 18:30:19,929
2,52,male,2,own,quite rich,None,936,9,education,0,2008-04-27 08:23:07,200
3,35,female,3,own,little,None,1393,11,car,0,2007-05-06 10:58:22,45
4,28,male,2,own,little,None,776,12,radio/TV,0,2007-07-21 13:22:14,358
...,...,...,...,...,...,...,...,...,...,...,...,...
995,65,male,2,free,little,little,2600,18,radio/TV,1,2007-12-16 20:17:19,624
996,30,male,3,own,little,moderate,4455,36,business,1,2007-07-12 14:08:58,181
997,33,male,2,own,little,moderate,6403,24,radio/TV,0,2008-04-08 03:24:26,730
998,29,female,2,own,None,None,5003,21,car,1,2007-11-29 15:51:45,557
999,44,male,2,own,moderate,moderate,1804,12,car,0,2007-08-14 09:05:33,23

# Clickhouse

In [11]:
import sqlalchemy as sa
con = sa.create_engine('clickhouse://default:@localhost:8123/default')

In [12]:
#создаем функцию для вызова запроса (чтобы не писать постоянно одно и то же)
def select(sql):
  return pd.read_sql(sql,con)

In [13]:
sql = '''SELECT * from ds_salaries'''
select(sql)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665,IN,50,IN,L

#### Создать таблицу в базе баднных

In [ ]:
# обязательно перечисляем все колонки и типы данных в них
create_table_query = '''
CREATE TABLE IF NOT EXISTS TABLE_NAME (
work_year UInt64,
experience_level String,
employment_type String,
job_title String,
salary UInt64,
salary_currency String,
salary_in_usd UInt64,
employee_residence String,
remote_ratio UInt64,
company_location String,
company_size String
) ENGINE = MergeTree()
ORDER BY work_year
'''

# ORDER BY - сортировка по столбцу (ОБЯЗАТЕЛЬНО!)

con.execute(create_table_query)

In [15]:
#при каждом запуске он удлиняет таблицу на ее величину из-за 'append'
salaries_test.to_sql('TABLE_NAME', con=con, if_exists='append', index=False)

NameError: name 'salaries_test' is not defined

# PostgreSQL

In [37]:
sql = '''select * from data_science_salaries AS t limit 3'''
select(sql)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S

In [41]:
# count(*) дает подсчет строк, которые загрузятся из DB
sql = '''select count(*) from data_science_salaries AS t
WHERE 
    t.salary BETWEEN '30000' AND '50000' 
    AND t.employment_type in ('FT')'''
select(sql)

   count
0    196

In [75]:
sql = '''SELECT * FROM data_science_salaries AS t
WHERE 
    t.salary BETWEEN '30000' AND '50000'
    AND t.employment_type in ('FT')
ORDER BY 
    t.salary desc, t.work_year desc
'''
# desc - по убыванию

select(sql)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Computer Vision Software Engineer,50000,EUR,53654,NL,100,CA,L
1,2023,SE,FT,Data DevOps Engineer,50000,EUR,53654,FR,50,FR,S
2,2023,MI,FT,Data Science Lead,50000,GBP,60761,GB,0,GB,M
3,2023,MI,FT,Data Scientist,50000,EUR,53654,RO,50,RO,L
4,2023,EN,FT,Data Analyst,50000,USD,50000,KW,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...
191,2022,EN,FT,Machine Learning Engineer,30000,USD,30000,GB,100,GB,L
192,2022,EN,FT,AI Scientist,30000,EUR,31520,PT,100,ES,M
193,2022,MI,FT,Data Analyst,30000,EUR,31520,GR,100,GR,M
194,2022,EN,FT,Data Scientist,30000,EUR,31520,ES,50,ES,M
195,2021,MI,FT,AI Scientist,30000,USD,30000,GH,0,GH,S